a = [*0..9]                     # => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 奇数の要素だけを持つ配列を作ろう。
a.select{|i| i.odd?}            # => [1, 3, 5, 7, 9]

a.select(&:odd?)                # => [1, 3, 5, 7, 9]

# ただし `odd?` メソッドは使用禁止。
a.select{|i| i % 2 == 1}        # => [1, 3, 5, 7, 9]

# 偶数でなければ、それは奇数
a.select{|i| i % 2 != 0}        # => [1, 3, 5, 7, 9]

# odd? が使えないなら even? を使えばいいじゃない
a.select{|i| !i.even?}          # => [1, 3, 5, 7, 9]

# Rubyist は条件式に ! (not) は書かない
a.reject{|i| i.even?}           # => [1, 3, 5, 7, 9]

a.reject(&:even?)               # => [1, 3, 5, 7, 9]
